Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: རིའི་རྒྱལ་པོ་ཆེན་པོ་ཁ་བ་ཅན་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་སྤོས་ངད་ཅན་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་རྣམ་པར་འདལ་བ་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་དྲང་སྲོང་རི་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་གཉའ་ཤིང་འཛིན་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་རྟ་རྣ་རི་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་ས་འཛིན་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་ཁོར་ཡུག་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་དཔལ་ཆེན་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་རི་རབ་བོ།
en: They are the king of mountains Himavat, the king of mountains Gandhamādana, the king of mountains Vaipulya, the king of mountains Ṛṣigiri, the king of mountains Yugandhara, the king of mountains Aśvakarṇagiri, the king of mountains Nimindhara, the king of mountains Cakravāḍa, the king of mountains Ketumat, and the king of mountains Sumeru. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལ་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་ཁ་བ་ཅན་ནི་སྨན་གྱི་རྣམ་པ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཏེ། སྨན་སྣ་ཚོགས་ཐམས་ཅད་བླངས་པས་མཐར་ཐུག་པ་མེད་དོ།
en: By analogy, the king of mountains Himavat is an unceasing source of all kinds of medicines because it possesses all medicines.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་རབ་ཏུ་དགའ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འཇིག་རྟེན་པའི་གཙུག་ལག་དང་། ཚིག་དང་སྔགས་དང་། རིག་པའི་གནས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། འཇིག་རྟེན་པའི་གཙུག་ལག་དང་ཆིག་དང་སྔགས་དང་། རིག་པའི་གནས་བསྟན་པས་མཐར་ཐུག་པ་མེད་དོ།
en: “O jinaputras! In that same way, the bodhisattva on the bodhisattva bhūmi Perfect Joy is the unceasing source of the branches of knowledge of worldly poetry, treatises, and mantras because of his mastery of all worldly poetry, treatises, and mantras. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ཅན་ནི། སྤོས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། སྤོས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་བླངས་པས་མཐར་ཐུག་པ་མེད་དོ།
en: By analogy, the king of mountains Gandhamādana is an unceasing source of the creation of all incense, because it possesses all incense.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་དྲི་མ་དང་བྲལ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་འང་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་། སྡོམ་པ་དང་ཚུལ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་སྡོམ་པ་དང་། ཚུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྤོས་ཀྱི་མཐར་ཐུག་པ་མེད་དོ།
en: In that same way, the bodhisattva on the bodhisattva bhūmi Stainless is the unceasing source of the incense of all bodhisattva conduct, vows, and activity because he possesses all bodhisattva conduct, vows, and activity.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་རྣམ་པར་འདལ་བ་ནི། རིན་པོ་ཆེའི་རང་བཞིན་ཤིན་ཏུ་དག་པ། རིན་པོ་ཆེའི་རྣམ་པ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་བླངས་བས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Vaipulya, which is made of jewels, is an unceasing source of all jewels because it possesses all worldly jewels.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འཇིག་རྟེན་པའི་བསམ་གཏན་དང་། མངོན་པར་ཤེས་པ་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། འཇིག་རྟེན་པའི་བསམ་གཏན་དང་། མངོན་པར་ཤེས་པ་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་ཟད་པ་མེད་དོ།
en: “O jinaputras! In that same way, the bodhisattva on the third bodhisattva bhūmi Shining is the unceasing source of worldly dhyānas, clairvoyances, liberations , samādhis, and samāpattis because he answers all questions on worldly dhyānas, clairvoyances, liberations , samādhis, and samāpattis.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ།
en: “O jinaputras!

source: དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་དྲང་སྲོང་རི་ནི་རིན་པོ་ཆེའི་རང་བཞིན་རྣམ་པར་དག་པ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པའི་འབྱུང་གནས་ཏེ། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པའི་དྲང་སྲོང་བགྲངས་པས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Ṛṣigiri, which is made of jewels, is an unceasing source of sages who have the five clairvoyances, because of its multitudes of all sages who have the five clairvoyances.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ལམ་དང་ལམ་མ་ཡིན་པའི་ཁྱད་པར་དང་། བྱེ་བྲག་ཤེས་པ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། ལམ་དང་ལམ་མ་ཡིན་པའི་ཁྱད་པར་དང་བྱེ་བྲག་གི་རྒྱུས་ཡོངས་སུ་དྲིས་པ་ཡོངས་སུ་བསྟན་པས་ཟད་པར་མི་འགྱུར་རོ།
en: In that same way, the bodhisattva on the bodhisattva bhūmi Brilliance is the unceasing source of worldly dhyānas, clairvoyances, liberations , samādhis, and samāpattis because of his knowledge of the different teachings on entering what is and what is not the path. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་གཉའ་ཤིང་འཛིན་ནི་རིན་པོ་ཆེའི་རང་བཞིན་རྣམ་པར་དག་པ་གནོད་སྦྱིན་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། གནོད་སྦྱིན་རྫུ་འཕྲུལ་ཆེན་པོ་ཅན་བགྲངས་བས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Yugandhara, which is made of jewels, is an unceasing source of yakṣas who have great miraculous powers, because of its multitudes of all yakṣas who have great miraculous powers.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་མངོན་པར་ཤེས་པ་དང་། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། མངོན་པར་ཤེས་པ་དང་། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་ཟད་པ་མེད་དོ།
en: “O jinaputras! In that same way, the bodhisattva on the bodhisattva bhūmi Difficult to Conquer is the unceasing source of all attainment of clairvoyance, miraculous powers, and magical manifestations because he answers all questions on the attainment of clairvoyance, miraculous powers, and magical manifestations. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་རྟ་རྣ་རི་ནི་རིན་པོ་ཆེའི་རང་བཞིན་རྣམ་པར་དག་པ། ཤིང་ཏོག་གི་རྣམ་པ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཏེ། ཤིང་ཏོག་གི་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་བླངས་པས་ཟད་པར་མི་འགྱུར་རོ།
en: By analogy, the pure king of mountains Aśvakarṇagiri, which is made of jewels, is an unceasing source of all fruits because it possesses all fruits.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི། ས་མངོན་སུམ་ལ་གནས་པའི། བྱང་ཆུབ་སེམས་དཔའ་ཡང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་པ་ཤིན་ཏུ་བསྟན་པའི་འབྱུང་གནས་ཡིན་ཏེ། ཉན་ཐོས་ཀྱི་འབྲས་བུ་མངོན་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་ཟད་པ་མེད་དོ།
en: In that same way, the bodhisattva on the bodhisattva bhūmi Manifested is the unceasing source of teaching the comprehension of dependent origination because he answers all questions on the realization of the result of the śrāvakas. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་ས་འཛིན་ནི་རིན་པོ་ཆེའི་རང་བཞིན་རྣམ་པར་དག་པ། ཀླུ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཏེ། ཀླུ་རྫུ་འཕྲུལ་ཆེན་པོ་ཅན་བགྲངས་པས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Nimindhara, which is made of jewels, is an unceasing source of all nāgas who have great miraculous powers, because of its multitudes of all nāgas who have great miraculous powers.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོང་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཐབས་དང་ཤེས་རབ་ཤིན་ཏུ་བསྟན་པའི་འབྱུང་གནས་ཡིན་ཏེ། རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་མངོན་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་ཡོངས་སུ་དྲིས་པ། བསྟན་པས་ཟད་པ་མེད་དོ།
en: In that same way, the bodhisattva on the bodhisattva bhūmi Gone Far is the unceasing source of teaching on method and wisdom because he answers all questions on the realization of the result of the pratyekabuddhas. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་ཁོར་ཡུག་ནི་རིན་པོ་ཆེ་ཆེན་པོའི་རང་བཞིན་རྣམ་པར་དག་པ་དབང་དུ་གྱུར་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། དབང་དུ་གྱུར་པ་བགྲངས་པས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Cakravāḍa, which is made of jewels, is an unceasing source of all those who have powers, because of its multitudes of those who have powers.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་མངོན་པར་བསྒྲུབ་པ། ཡོངས་སུ་དྲིས་པ་ཤིན་ཏུ་བསྟན་པའི་འབྱུང་གནས་ཡིན་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་ཟད་པ་མེད་དོ།
en: In that same way, the bodhisattva on the bodhisattva bhūmi Unwavering is the unceasing source of the attainment of the powers of a bodhisattva because he answers all questions on the divisions of worlds. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་དཔལ་དང་ལྡན་པ་ནི་རིན་པོ་ཆེའི་རང་བཞིན་རྣམ་པར་དག་པ་ལྷ་མ་ཡིན་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། ལྷ་མ་ཡིན་རྫུ་འཕྲུལ་ཆེན་པོ་ཅན་བགྲངས་པས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Ketumat, which is made of jewels, is an unceasing source of all asuras who have great miraculous powers, because of its multitudes of asuras who have great miraculous powers.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་འབྱུང་བ་དང་། འཇིག་པ་ཤེས་པའི་རྒྱུད་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། འགྲོ་བ་ཐམས་ཅད་འབྱུང་བ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་ཟད་པ་མེད་དོ།
en: “O jinaputras! In that same way, the bodhisattva on the bodhisattva bhūmi Perfect Understanding is the unceasing source of the nature of the knowledge of the coming into existence and passing away of all beings, because he answers all questions on the formation and destruction of all worlds. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་ཆེན་པོ་རི་རབ་ནི་རིན་པོ་ཆེའི་རང་བཞིན་རྣམ་པར་དག་པ་ལྷ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། ལྷ་རྫུ་འཕྲུལ་ཆེན་པོ་ཅན་བགྲངས་པས་ཟད་པ་མེད་དོ།
en: By analogy, the pure king of mountains Sumeru, which is made of jewels, is an unceasing source of all devas who have great miraculous powers, because of its multitudes of devas who have great miraculous powers.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མྱི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ། སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་ཡང་དག་པར་བསྟན་པ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་ཟད་པ་མེད་དོ།
en: “O jinaputras! In that same way, the bodhisattva on the bodhisattva bhūmi Cloud of Dharma is the unceasing source of the strengths, confidences, and unique buddha qualities because he answers all questions on the manifestation of the activity of the buddhas. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་ཇི་ལྟར་རིན་པོ་ཆེའི་རི་ཆེན་པོ་དེ་དག་རྒྱ་མཚོ་ཆེན་པོ་ལས་བྱུང་ཞིང་རྒྱ་མཚོ་ཆེན་པོ་ལས་སྨོས་པ་དེ་བཞིན་དུ། ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་འདི་དག་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་བྱུང་ངོ་། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་སྨོས་པའོ། །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Just as these ten great precious mountains have been produced from the great ocean, have arisen from the great ocean, in the same way, O jinaputras, these ten bodhisattva bhūmis have been produced from omniscience, have arisen from omniscience. “O jinaputras!

source: རྒྱ་མཚོ་ཆེན་པོ་ནི་རྣམ་པ་བཅུས་མི་འཕྲོགས་པའི་ཕྱིར་རྒྱ་མཚོའི་གྲངས་སུ་འགྲོ་སྟེ།
en: By analogy, the great ocean is counted among the insuperable because of ten of its features. What are these ten? (1) It gets progressively deeper. ( ) A corpse does not remain in it. (3) It is not identified with other waters.

source: རིམ་གྱིས་གཞོལ་བ་དང་། ཤི་བའི་རོ་དང་མྱི་འགོགས་པ་དང་། ཆུ་གཞན་གྱི་གྲངས་ཡོངས་སུ་སྤངས་པ་དང་། རོ་གཅིག་པ་དང་། རིན་པོ་ཆེ་མང་བ་དང་། ཟབ་ཅིང་གཏིང་རིང་བ་དང་། ཡངས་ཤིང་ཚད་མེད་པ་དང་། འབྱུང་བོ་མང་པོའི་གནས་སུ་གྱུར་པ་དང་། དབྲེས་ཀྱི་ཚུལ་ལས་མི་འདའ་བ་དང་། སྤྲིན་ཆེན་པོའི་ཆར་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པས་མི་ངོམས་པའོ།
en: (6) It is deep and unfathomable. (7) It is vast and immeasurable. (8) It is the dwelling place of great creatures. (9) It never misses a tide. (10) It receives water from the clouds without becoming fulfilled.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སྤྱོད་པའི་རྣམ་པ་བཅུས་མི་འཕྲོགས་པའི་གྲངས་སུ་འགྲོའོ།
en: In the same way, a bodhisattva is insuperable because of ten bodhisattva conducts.

source: །བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are these ten?

source: བྱང་ཆུབ་སེམས་དཔའི་ས་རབ་ཏུ་དགའ་བ་ལ་སྨོན་ལམ་ཆེན་པོ་རིམ་གྱིས་མངོན་པར་བསྒྲུབས་པས་གཞོལ་བ་དང་བྱང་ཆུབ་སེམས་དཔའི་ས་དྲི་མ་དང་བྲལ་བ་ལ་ཚུལ་ཁྲིམས་ངན་པའི་རོ་དང་མི་འགྲོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་ལ་འཇིག་རྟེན་པ་རྣམ་པར་གདགས་པའི་གྲངས་ཡོངས་སུ་སྤངས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་ལ།
en: (1) On the bodhisattva bhūmi Perfect Joy there is a progressively deeper accomplishment of his great prayers. ( ) On the bodhisattva bhūmi Stainless the corpse of incorrect conduct does not remain. (3) On the bodhisattva bhūmi Shining he surpasses worldly designations and identifications. (4) On the bodhisattva bhūmi Brilliance he has the one taste of stainless aspiration to buddhahood. (5) On the bodhisattva bhūmi Difficult to Conquer he has the many jewels of accomplishing worldly activities through immeasurable method and wisdom.

source: སངས་རྒྱས་ལ་མོས་པ་མི་ཕྱེད་པའི་རོ་གཅིག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་ལ་ཐབས་དང་མངོན་པར་ཤེས་པ་ཚད་མེད་པས་འཇིག་རྟེན་གྱི་བྱ་བ་མངོན་པར་བསྒྲུབས་པའི་རིན་པོ་ཆེ་མང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རབ་ཏུ་བརྟགས་པས་ཤིན་ཏུ་ཟབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོང་བ་ལ་བློ་དང་རྣམ་པར་འབྱེད་པ་དང་། མཁས་པ་ཡངས་ཤིང་ཚད་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ལ་རྒྱན་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པ་ཡང་དག་པར་བསྟན་པའི་འབྱུང་པོ་མང་པོ་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་ལ་རྣམ་པར་ཐར་པ་ཐབ་མོ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པའི་ཚུལ་གྱི་དབྲེས་ལས་མི་འདའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་སྣང་བའི་སྤྲིན་ཆེན་པོའི་ཆར་ཡང་དག་པར་བཟུང་བས།
en: (6) On the bodhisattva bhūmi Manifested there is the unfathomable depth of the analysis of dependent origination. (7) On the bodhisattva bhūmi Gone Far there is the immeasurably vast skill of analysis with intelligence. (8) On the bodhisattva bhūmi Unwavering there is the presence of the many great creatures of manifesting the accomplishment of great displays. (9) On the bodhisattva bhūmi Perfect Understanding he never misses the tide through his comprehension of activities of beings through profound liberation. (10) On the bodhisattva bhūmi Cloud of Dharma he receives without being fulfilled water from the clouds of the radiance of the Dharma of all the tathāgatas.

source: མི་ངོམས་པའོ།
en: “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ནི་རིན་པོ་ཆེའི་མཁན་པོ་མཁས་པས་ཤིན་ཏུ་བསྲེགས་ཤིན་ཏུ་བསྒྲུབས་ཤིན་ཏུ་སྦྱངས་ཤིན་ཏུ་ཡང་དག་པར་བྱས་ལེགས་པར་ཕུག །རིན་པོ་ཆེའི་སྲད་བུས་ལེགས་པར་བཏགས། རིན་པོ་ཆེའི་བཻ་ཌཱུརྱའི་རྩ་བའི་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཞག་སྟེ། འོད་ཐམས་ཅད་འབྱུང་བར་འགྱུར་ལ་རྒྱལ་པོས་བསྔགས་པར་གྱུར་ཏེ། རིན་པོ་ཆེའི་རིགས་བཅུ་ལས་འདས་ཤིང་ཤིན་ཏུ་འཕགས་པར་གྱུར་པ་དེའི་ཚེ།
en: By analogy, a great jewel is chosen (1) as superior to the ten kinds of jewels, and it is ( ) heated, (3) shaped, (4) cleansed, (5) polished, (6) pierced, (7) threaded on a string of jewels by a skilled jeweler, and (8) fixed upon a standard that is a tall pole of precious beryl jewels, where it (9) shines light on everything and (10) is authorized by the king.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རིན་པོ་ཆེས་ཕན་གདགས་པའི་དོན་དུ་ཉེ་བར་གནས་པ་ཡིན།
en: Thus it becomes the location where jewels accumulate for all beings. “O jinaputra!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་རིན་པོ་ཆེ་བསྐྱེད་པ་ཡང་སྦྱངས་པའི་ཡོན་ཏན་གྱི་སྡོམ་པ་དང་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཤུགས་དང་དཀའ་ཐུབ་ཀྱིས་ཤིན་ཏུ་བསྲེགས། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པས་ཤིན་ཏུ་བསྒྲུབས། ལམ་གྱི་ཡན་ལག་གི་རྣམ་པས་ཤིན་ཏུ་སྦྱངས། ཐབས་དང་མངོན་པར་ཤེས་པས་ཤིན་ཏུ་དག་པར་བྱས། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་ཤིན་ཏུ་ཕུག །ཐབས་དང་ཤེས་རབ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྲད་བུས་ཤིན་ཏུ་བཏགས། དབང་གི་རིན་པོ་ཆེ་བཻ་ཌཱུཪྻའི་ཡུ་བའི་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཞག །སེམས་ཅན་གྱི་སྤྱོད་པ་རབ་ཏུ་བརྟགས་པ་དང་། ཐོས་པའི་ཡེ་ཤེས་ཀྱི་འོད་རབ་ཏུ་འབྱུང་བར་གྱུར་ཏེ། ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་མངོན་པར་དབང་བསྐུར་བས་དབང་བསྐུར་བར་གྱུར་པ་དེའི་ཚེ།
en: In that same way, the jewel of a bodhisattva’s development of aspiration to omniscience (1) transcends the jewels of the ten noble families, ( ) is heated by qualities of purification, abstinence, correct conduct, particular disciplines, and asceticism, (3) is shaped by dhyāna, samādhi, and samāpatti, (4) is cleansed by the aspects and branches of the path, (5) is polished by method and clairvoyance, (6) is pierced by dependent origination, (7) is strung on the string of the various jewels of method and wisdom, (8) is fixed upon the tip of a powerful standard that is a tall pole of precious beryl jewels, (9) shines with the light of the wisdom of viewing and hearing the conduct of beings, and (10) is consecrated by the kings of the Dharma, the tathāgata samyak­sambuddhas.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་ཕན་གདགས་པའི་དོན་དུ་ཉེ་བར་གནས་པ་ཡིན་ཏེ།
en: “Thus he becomes the location where the jewels of the deeds of a buddha accumulate for all beings.

source: དེའི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཞེས་ཀྱང་བྱའོ། །ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་པས་སྤྱོད་པ་ཡང་དག་པར་བསྒྲུབ་ཅིང་།
en: At that time he is called omniscient . “O jinaputra!

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་ཡོན་ཏན་ཡང་དག་པར་བསྩགས་པའི་ཆོས་ཀྱི་སྒོའི་རྒྱུད་འདི་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ཀྱི་རྣ་ལམ་དུ་གྲག་པར་མི་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་སྨྲས་པ།
en: This teaching of entry into the Dharma, which is the accomplishment of bodhisattva conduct and an aggregation of the qualities of completely omniscient wisdom, will not be heard by beings who have not developed roots of goodness.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་འོ་ན་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་ཡོན་ཏན་ཡང་དག་པར་བསྩགས་པའི་ཆོས་ཀྱི་སྒོའི་རྒྱུད་འདི་གང་གི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་དེ་དག་བསོད་ནམས་ཀྱི་ཚོགས་ཇི་ཙམ་ཞིག་དང་ལྡན་པར་འགྱུར།
en: The bodhisattva Vimukti­candra asked, “O jinaputra! How much merit will be accumulated by those who do hear this teaching of entry into the Dharma, which is the accomplishment of bodhisattva conduct and an aggregation of the qualities of completely omniscient wisdom?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་མཐུ་ཇི་ཙམ་པ་དེ་སྙེད་ཀྱི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་ཅིང་བསྒྲུབ་པར་དམིགས་པ་ལ་ཡོད་དེ།
en: However much power omniscient wisdom has, that is the extent of the accumulation of merit from being focused on acquiring the aspiration for omniscience.

source: ཆོས་ཀྱི་སྒོའི་རྒྱུད་འདི་གྲག་ཅིང་མངོན་པར་གྱུར་པའི་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱང་དེ་ཙམ་དུ་ཤེས་པར་བྱའོ།
en: The accumulation of merit from being focused on acquiring the aspiration for omniscience is the extent of the accumulation of merit that will be attained from being devoted to this teaching of entry into the Dharma.

source: ཀྱེ་རྒྱལ་བའི་སྲས་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་ཡོན་ཏན་ཡང་དག་པར་བསྩགས་པའི་ཆོས་ཀྱི་རྒྱུད་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན་པས་མཉན་པ་འམ། མོས་པར་བྱ་བ་འམ། གཟུང་བར་ཡང་མི་ནུས་ན་བསྒོམ་པའི་རྣམ་པར་སྦྱོར་བས་བརྩོན་པར་མི་ནུས་པ་ལྟ་ཅི་སྨོས། དེ་བས་ན་ཀྱེ་རྒྱལ་བའི་སྲས་གང་གིས་ཆོས་ཀྱི་སྒོའི་རྒྱུད་འདི་ཐོས་ཏེ་ཐོས་ནས་མོས་པར་བྱེད་པ་དང་། མོས་པར་བྱས་ཤིང་འཛིན་པ་དང་། བསྒོམ་པའི་རྣམ་པས་བརྩོན་པར་བྱེད་ན།
en: No one other than a bodhisattva can hear, be attracted to, believe, adopt, keep, or possess this teaching of entry into the Dharma, which is the accomplishment of bodhisattva conduct and an aggregation of the qualities of completely omniscient wisdom, let alone attain dedicated application to meditation upon it.

source: སེམས་ཅན་དེ་དག་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་དང་ལྡན་པར་ཤེས་པར་བྱའོ།
en: “Therefore, O jinaputra, it is those who have attained the entrance to omniscience who will possess it. It is they who will hear this teaching of entry into the Dharma, which is the accomplishment of bodhisattva conduct and an aggregation of the qualities of completely omniscient wisdom, and having heard it will be attracted to it, and having been attracted to it will maintain it and be dedicated to meditation upon it.”

source: །དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུ་དང་ཆོས་ཉིད་ཐོབ་པས། ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པ་དྲུག་དང་ལྟས་ཆེན་པོ་བཅྭོ་བརྒྱད་དུ་གཡོས་སོ། །རབ་ཏུ་གཡོས་སོ། །ཀུན་ཏུ་གཡོས་སོ།
en: At that time, through the power of the buddhas and the realization of the true nature, all the atoms of the hundred million buddha realms of the worlds in the ten directions, in eighteen great signs and in six ways, (1) trembled, trembled strongly, and trembled fiercely;

source: །འགུལ་ཏོ་རབ་ཏུ་འགུལ་ཏོ། །ཀུན་ཏུ་འགུལ་ཏོ།
en: ) shook, shook strongly, and shook fiercely;

source: །ལྡེག་གོ་རབ་ཏུ་ལྡེག་གོ །ཀུན་ཏུ་ལྡེག་གོ །ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ།
en: (3) shuddered, shuddered strongly, and shuddered fiercely; (4) rumbled, rumbled strongly, and rumbled fiercely;

source: ཀུན་ཏུ་ཆེམ་ཆེམ་མོ། །འུར་འུར་རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་འུར་འུར་རོ།
en: (5) quaked, quaked strongly, and quaked fiercely; and (6) roared, roared strongly, and roared fiercely.

source: །ཤིག་ཤིག་རབ་ཏུ་ཤིག་ཤིག །ཀུན་ཏུ་ཤིག་ཤིག་གོ །སངས་རྒྱས་ཀྱི་མཐུ་དང་ཆོས་ཉིད་རབ་ཏུ་ཐོབ་པས་ལྷ་རྫས་ཀྱི་འཕྲེང་བའི་སྤྲིན་གྱི་ཆར་མངོན་པར་བབ་བོ། །ལྷ་རྫས་ཀྱི་གོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་བབ་བོ། །ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་མངོན་པར་བབ་བོ། །ལྷ་རྫས་ཀྱི་གདུགས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་བབ་བོ། །ལྷ་རྫས་ཀྱི་རྒྱལ་མཚན་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་བབ་བོ།
en: Through the power of the buddhas and the realization of the true nature, there fell rain from clouds of divine garlands, flowers, and incense; and there fell rain from clouds of divine cloth, clouds of divine powders, clouds of divine jewels, clouds of divine ornaments, clouds of divine parasols, clouds of divine banners, and clouds of divine flags. Clouds of divine music and song resounded.

source: །ལྷ་རྫས་ཀྱི་བ་དན་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་བབ་བོ། །ལྷ་རྫས་ཀྱི་རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་དང་གླུའི་དབྱངས་ཀྱི་སྤྲིན་གྱི་སྒྲ་མངོན་པར་སྒྲོག་གོ །ལྷ་རྫས་ལས་འདས་པའི་ཐམས་ཅད་མཁྱེན་པའི་ས་ལ་མངོན་པར་བསྟོད་པའི་གླུའི་དབྱངས་ཀྱི་སྤྲིན་གྱི་སྒྲ་དབྱངས་མངོན་པར་སྒྲོག་གོ །ཇི་ལྟར་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་གནས་སུ་ལྷའི་རྒྱལ་པོ་དབང་བསྒྱུར་གྱི་གཞལ་མེད་ཁང་ནོར་བུ་རིན་པོ་ཆེའི་སྙིང་པོར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཡང་ཕྱོགས་བཅུ་རྒྱས་པར་གང་ཞིང་ཆོས་བསྟན་པ་འདི་ཡང་ཐམས་ཅད་དུ་བྱུང་བར་གྱུར་ཏོ།
en: Clouds of songs that transcended the divine and praised the state of omniscience resounded. Just as it was on that central platform of precious jewels in the deva king Vaśavartin’s palace in the Para­nirmita­vaśa­vartin paradise of this four-continent world, in that same way the Dharma teaching spread and appeared throughout all worlds in the ten directions.

source: །སངས་རྒྱས་ཀྱི་མཐུས་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཕྱོགས་བཅུ་རྒྱས་པར་བྱེད་ཅིང་ལྷགས་ཏེ་དེ་དག་ཕྱིན་ནས་ཀྱང་འདི་སྐད་ཅེས་ཟེར་རོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་འདི་བརྗོད་པ་ལེགས་སོ་ལེགས་སོ།
en: Through the power of the buddhas and the realization of the true nature, bodhisattvas as numerous as the atoms in a hundred million buddha realms came from worlds in the ten directions that were as numerous as the atoms in a hundred million buddha realms. They who were spread throughout the ten directions arrived there and said, “Excellent! Excellent! O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བདག་ཅག་ཀྱང་རྡོ་རྗེའི་སྙིང་པོ་ཞེས་བྱ་བར་མིང་མཐུན་པ་ཤ་སྟག་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་རྡོ་རྗེའི་དཔལ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་གཤེགས་པ་མཚན་རྡོ་རྗེའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དག་གི་དྲུང་ནས་འདིར་ལྷགས་ཏེ།
en: We also all have the same name, Vajra­garbha, and have come from numerous realms that are named Vajraśrī, from the presence of tathāgatas named Vajradhvaja.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ན་ཡང་ཆོས་བསྟན་པ་འདི་ཉིད་སངས་རྒྱས་ཀྱི་མཐུས་འཁོར་གྱི་རྣམ་པ་འདི་འདྲ་བ་དག་ལ་ཚིག་འདི་དག་ཉིད་དང་ཡི་གེ་འདི་དག་ཉིད་དང་ཁོང་དུ་ཆུད་པར་བྱ་བ་འདི་དག་ཉིད་དང་། དོན་འདི་ཉིད་ལྷག་ཆད་མེད་པར་མངོན་པར་བརྗོད་དེ་འབྱུང་བར་གྱུར་ཏོ།
en: In all those realms, through the power of the buddhas, this same Dharma teaching is being given in the same kind of assemblies, with the same words, the same letters, and the same pronunciation, with the same intended meaning, and without any omission or addition. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བདག་ཅག་ཀྱང་དབང་དུ་གྱུར་པ་ཤ་སྟག །སངས་རྒྱས་ཀྱི་མཐུས་འཁོར་འདིར་ཕྱིན་ཏོ།
en: Through the power of the buddhas we have come to this assembly to bear witness.
